Revit 2027 API
EnergyAnalysisSpace.GetClosedShell Method
 Gets the collection of polygons that form a closed shell. This method returns a collection of polyloops (planar polygons) that defines an enclosed volume measured by interior bounding surfaces, if in rooms and spaces mode. In other modes, returns no polyloops.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Polyloop> GetClosedShell()
Public Function GetClosedShell As IList(Of Polyloop)
public:
IList<Polyloop^>^ GetClosedShell()
member GetClosedShell : unit -> IList<Polyloop>
Return Value
IList<Polyloop>
 the collection of polygons that form a closed shell.
See Also
Reference
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace